app/controllers/routes_controller.rb

  def view
    @item = Route.find(params[:id])
    @stations = RouteStation.find(:all, :conditions => "route_id = #{params[:id]}", :order => 'dep_day, dep_hour')
    @dates = RouteDate.find(:all, :conditions => "route_id = #{params[:id]}", :order => 'date')
---
SELECT * FROM "routes" WHERE ("routes"."id" = 1)
SELECT * FROM "route_stations" WHERE (route_id = 1) ORDER BY dep_day, dep_hour
SELECT * FROM "stations" WHERE ("stations"."id" = 5)
SELECT * FROM "route_dates" WHERE (route_id = 1) ORDER BY date

  def edit_station
    @item = RouteStation.find(params[:id])
---
SELECT * FROM "route_stations" WHERE ("route_stations"."id" = 18)

  def edit_station_commit
    rs = RouteStation.find(params['route_station']['id'])
    unless rs.nil?
      rs.attributes = params['route_station']
      rs.percents /= 100
      rs.save
---
SELECT * FROM "route_stations" WHERE ("route_stations"."id" = 18)
UPDATE "route_stations" SET "updated_at" = '2010-12-16 23:16:02', "percents" = 0.6 WHERE "id" = 18

  def add_station
    @route_id = params[:route_id]
    @transport = Route.find(params[:route_id]).transport
---
SELECT * FROM "routes" WHERE ("routes"."id" = 1)

  def add_station_commit
    rs = RouteStation.new
    rs.attributes = params['route_station']
    rs.percents /= 100
    rs.save
---
INSERT INTO "route_stations" ("arr_minute", "created_at", "dep_day", "updated_at", "arr_hour", "percents", "dep_minute", "dep_hour", "route_id", "station_id", "arr_day") VALUES(0, '2010-12-16 23:14:18', 0, '2010-12-16 23:14:18', 12, 6000.0, 10, 12, 1, 7, 0)

  def delete_station
    rs = RouteStation.find(params[:id])
    rs.destroy unless rs.nil?
---
SELECT * FROM "route_stations" WHERE ("route_stations"."id" = 18)
DELETE FROM "route_stations" WHERE "id" = 18

  def edit_dates
    @dates = RouteDate.find(:all, :conditions => "route_id = #{params[:route_id]}", :order => 'date')
    @route = Route.find(params[:route_id])
---
SELECT * FROM "route_dates" WHERE (route_id = 1) ORDER BY date
SELECT * FROM "routes" WHERE ("routes"."id" = 1)

  def add_date_commit
    rd = RouteDate.new
    rd.attributes = params[:route_date]
    rd.save
---
INSERT INTO "route_dates" ("created_at", "updated_at", "date", "route_id") VALUES('2010-12-18 13:31:36', '2010-12-18 13:31:36', '2011-01-01', 1)

  def view_places
    @route = Route.find(params[:route_id])
---
SELECT * FROM "routes" WHERE ("routes"."id" = 1)

  def view_train_places
    @places = TrainDatePlace.find(:all, :conditions => "route_date_id = #{params[:date]}", :order => 'wagon_number, place_num')
    @date = RouteDate.find(params[:date])
    @route = Route.find(params[:route])
---
SELECT * FROM "train_date_places" WHERE (route_date_id = 1) ORDER BY wagon_number, place_num
SELECT * FROM "route_dates" WHERE ("route_dates"."id" = 1)
SELECT * FROM "routes" WHERE ("routes"."id" = 1)

  def view_plane_places
    @places = PlaneDatePlace.find(:all, :conditions => "route_date_id = #{params[:date]}", :order => 'place_num')
    @date = RouteDate.find(params[:date])
    @route = Route.find(params[:route])
---
SELECT * FROM "plane_date_places" WHERE (route_date_id = 130) ORDER BY place_num
SELECT * FROM "route_dates" WHERE ("route_dates"."id" = 130)
SELECT * FROM "routes" WHERE ("routes"."id" = 5)

  def view_bus_places
    @places = BusDatePlace.find(:all, :conditions => "route_date_id = #{params[:date]}", :order => 'place_num')
    @date = RouteDate.find(params[:date])
    @route = Route.find(params[:route])
---
SELECT * FROM "bus_date_places" WHERE (route_date_id = 110) ORDER BY place_num
SELECT * FROM "route_dates" WHERE ("route_dates"."id" = 110)
SELECT * FROM "routes" WHERE ("routes"."id" = 6)

  def buy_place
    @route = Route.find(params[:route_id])
    @route.transport == 0 ? dp = PlaneDatePlace.find(params[:id]) : (@route.transport == 1 ? dp = TrainDatePlace.find(params[:id]) : dp = BusDatePlace.find(params[:id]))
    dp.attributes = {:purchased => true}
    dp.save
---
SELECT * FROM "routes" WHERE ("routes"."id" = 5)
SELECT * FROM "plane_date_places" WHERE ("plane_date_places"."id" = 4961)
UPDATE "plane_date_places" SET "updated_at" = '2010-12-17 16:47:01', "purchased" = 't' WHERE "id" = 4961

  def edit_prices
    @date = RouteDate.find(params[:date])
    @route = Route.find(params[:route])
---
SELECT * FROM "route_dates" WHERE ("route_dates"."id" = 1)
SELECT * FROM "routes" WHERE ("routes"."id" = 1)

  def edit_prices_commit
    @route = Route.find(params[:route])
    if @route.transport == 0
      tp = PlanePrice.find(:all, :conditions => "route_date_id = #{params['unit']['route_date_id']} and category_id = #{params['unit']['category_id']}").first
      tp = PlanePrice.new if tp.nil?
    elsif @route.transport == 1
      tp = TrainPrice.find(:all, :conditions => "route_date_id = #{params['unit']['route_date_id']} and category_id = #{params['unit']['category_id']}").first
      tp = TrainPrice.new if tp.nil?
    else
      tp = BusPrice.find(:all, :conditions => "route_date_id = #{params['unit']['route_date_id']}").first
      tp = BusPrice.new if tp.nil?
    end
    tp.attributes = params['unit']
    tp.save
---
SELECT * FROM "routes" WHERE ("routes"."id" = 1)
SELECT * FROM "bus_prices" WHERE (route_date_id = 110)
SELECT * FROM "plane_prices" WHERE (route_date_id = 130 and category_id = 0)
SELECT * FROM "train_prices" WHERE (route_date_id = 1 and category_id = 0)
INSERT INTO "bus_prices" ("route_date_id", "price", "created_at", "updated_at") VALUES(110, 500, '2010-12-17 16:50:20', '2010-12-17 16:50:20')
INSERT INTO "plane_prices" ("route_date_id", "price", "created_at", "updated_at", "category_id") VALUES(130, 1333, '2010-12-17 16:43:31', '2010-12-17 16:43:31', 0)
INSERT INTO "train_prices" ("route_date_id", "price", "created_at", "updated_at", "category_id") VALUES(1, 345, '2010-12-16 23:19:13', '2010-12-16 23:19:13', 2)
UPDATE "plane_prices" SET "updated_at" = '2010-12-17 16:46:57', "price" = 4454 WHERE "id" = 2