app/controllers/ticket_controller.rb

  def list_route
    if (params['ticket']['transports']!=nil && params['ticket']['transports'].size != 0)
       @transport = (params['ticket']['transports']).join(', ') << ')'
       @station_trucking = Station.find(:all, :conditions => "city = '#{params['ticket']['city_station_trucking']}' and transport in (" << @transport).
                           map{|i| i = i.id}.join(', ') << ')'
       @station_arrival = Station.find(:all, :conditions => "city = '#{params['ticket']['city_station_arrival']}' and transport in (" << @transport).
                           map{|i| i = i.id}.join(', ') << ')'
       @all_routes = ((RouteStation.find(:all, :conditions => "station_id in (" << @station_trucking ).map{|i| i = i.route_id}) &    	 			      (RouteStation.find(:all, :conditions => "station_id in (" << @station_arrival ).map{|i| i = i.route_id})).
                     map{|i| i = Route.find(i)} & Route.find(:all, :conditions => "transport in (" << @transport)
---
SELECT * FROM "stations" WHERE (city = 'Москва' and transport in (0, 1))
SELECT * FROM "route_stations" WHERE (route_id = '1' and station_id in (1, 2, 5, 9, 13))
SELECT * FROM "routes" WHERE (id in (1)) ORDER BY transport, number

  def view
    @item = Route.find(params[:id])
    @stations = RouteStation.find(:all, :conditions => "route_id = #{params[:id]}", :order => 'dep_day, dep_hour')
    @dates = RouteDate.find(:all, :conditions => "route_id = #{params[:id]}", :order => 'date')
---
SELECT * FROM "routes" WHERE ("routes"."id" = 1)
SELECT * FROM "route_stations" WHERE (route_id = 1) ORDER BY dep_day, dep_hour
SELECT * FROM "stations" WHERE ("stations"."id" = 5)
SELECT * FROM "route_dates" WHERE (route_id = 1) ORDER BY date